Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The effect is most visible when the view size is set to "fixed" or "wrap content," in which case the view is centered between the constraints.
zh_cn: 当 view 大小设置为 "Fixed" 或 "Wrap Content" 时，效果最明显，在这种情况下 view 在约束之间居中。

source: The elapsed time encompasses the following sequence of events:
zh_cn: 经过的时间包括以下事件序列：

source: The encoded data contained an error.
zh_cn: 编码数据包含错误。

source: The encoded data was incomplete.
zh_cn: 编码数据不完整。

source: The end bound for a child's indicator.
zh_cn: 子项指示器的结束边界。

source: The end bound for an item's indicator.
zh_cn: 项目指示器的结束界限。

source: The end margin to use when the target is gone.
zh_cn: 当目标 gone 时使用的 end margin。

source: The entry can then be re-used for the same key, or compacted later in a single garbage collection step of all removed entries.
zh_cn: 然后可以对同一个键重新使用该项，或者稍后在所有已移除项的单个垃圾收集步骤中压缩该项。

source: The exact appearance and interaction model of this widget may vary between OS versions and themes (e.g. Holo versus Material), but in general a user can select a date by tapping on it and can scroll or fling the calendar to a desired date.
zh_cn: 该小部件的确切外观和交互模型可以在 OS 版本和主题(例如，Holo 与 Material)之间变化，但是通常用户可以通过点击它来选择日期并且可以将日历滚动或投掷到期望的日期。

source: The exception is try-catch statements.
zh_cn: try-catch 语句是例外情况。

source: The explicit state of a matcher includes the start and end indices of the most recent successful match.
zh_cn: 匹配器的显式状态包括最近成功匹配的开始和结束索引。

source: The explicit state of a matcher is initially undefined; attempting to query any part of it before a successful match will cause an IllegalStateException to be thrown.
zh_cn: 匹配器的显式状态最初是未定义的； 在成功匹配前尝试查询其中的任何部分将抛出 IllegalStateException 。

source: The explicit state of a matcher is recomputed by every match operation.
zh_cn: 每个匹配操作都将重新计算匹配器的显式状态。

source: The extra logic exists to support touch, mouse, keyboard, and accessibility navigation.
zh_cn: 存在额外的逻辑以支持触摸，鼠标，键盘和辅助功能导航。

source: The fabAlignmentMode determines the horizontal positioning of the cradle and the FAB which can be centered or aligned to the end.
zh_cn: fabAlignmentMode 确定 cradle 和 FAB 的水平位置，FAB 可以居中或对齐到末端。

source: The fabAnimationMode determines the animation used to move the FAB between different alignment modes.
zh_cn: fabAnimationMode 确定用于在不同对齐模式之间移动 FAB 的动画。

source: The file uses Android's binary XML format.
zh_cn: 该文件使用 Android 的二进制 XML 格式。

source: The filename is arbitrary.
zh_cn: 文件名是任意的。

source: The final span position of the item.
zh_cn: item 的 span 位置。

source: The first day of week according to Calendar.
zh_cn: 根据 Calendar 的一周的第一天。

source: The first pair is known as measured width and measured height.
zh_cn: 第一对称为 measured width (测量宽度) 和 measured height (测量高度)。

source: The first two works in a similar fashion as other layouts.
zh_cn: 前两个的效果与其他布局类似。

source: The first year (inclusive), for example "1940".
zh_cn: 第一年(包括)，例如“1940”。

source: The flexibility of a view is therefore influenced by its alignment which is, in turn, typically defined by setting the LayoutParams#setGravity(int) property of the child's layout parameters.
zh_cn: 因此，view 的灵活性受其对齐的影响，而对齐通常通过设置子项布局参数的 LayoutParams#setGravity(int) 属性来定义。

source: The following XML snippet is a common example of using an ImageView to display an image resource:
zh_cn: 以下 XML 代码段是使用 ImageView 显示图像资源的常见示例：

source: The following code sample shows a typical use, with an XML layout and code to modify the contents of the text view:
zh_cn: 以下代码示例显示了一个典型用法，使用 XML 布局和代码来修改文本 view 的内容：

source: The following code snippet provides an example of turning a "thumb up" into a "thumb down" by pivoting at the middle of the image and rotating it 180 degrees:
zh_cn: 以下代码片段提供了一个示例，通过在图像中间旋转并将其旋转 180 度，将 "拇指向上" 变为 "拇指向下"：

source: The following code snippet shows how to create a text view which suggests various countries names while the user is typing:
zh_cn: 以下代码段显示了如何创建文本 view，该 view 在用户键入时建议各种国家/地区名称：

source: The following example demonstrates how to render the camera preview into a TextureView:
zh_cn: 以下示例演示如何将相机预览渲染到 TextureView 中：

source: The following example shows a determinate progress bar that is 25% complete:
zh_cn: 以下示例显示了 25% 完成的确定进度条：

source: The following example shows an indeterminate progress bar:
zh_cn: 以下示例显示了一个不确定的进度条：

source: The following snippet shows how PieChart exposes a property called showText:
zh_cn: 以下代码段显示 PieChart 如何公开名为 showText 的属性：

source: The following snippet shows how to include a linear layout in your layout XML file:
zh_cn: 以下代码段显示了如何在布局 XML 文件中包含线性布局：

source: The following units of measure are supported by Android:
zh_cn: Android 支持以下度量单位：

source: The former returns the left, or X, coordinate of the rectangle representing the view.
zh_cn: 前者返回呈现 view 的矩形的 left 坐标或 X 坐标。

source: The fragment of each page the user visits will be kept in memory, though its view hierarchy may be destroyed when not visible.
zh_cn: 用户访问的每个页面的 fragment 都将保留在内存中，尽管它的视图层次结构可能在不可见时被 destroy 了。

source: The framework may have dropped the up or cancel event for the previous gesture
zh_cn: 框架可能已放弃上一个手势的 up 或 cancel 事件

source: The framework may have dropped the up or cancel event for the previous gesture due to an app switch, ANR, or some other state change.
zh_cn: 框架可能已放弃上一个手势的 up 或 cancel 事件，由于应用程序切换、ANR 或某些其他状态更改。

source: The framework provides basic support for views that wish to internally scroll their content.
zh_cn: 框架为想要内部滚动内容的 view，提供基本的支持。

source: The framework will handle routine focus movement in response to user input.
zh_cn: 框架将处理日常的焦点移动以响应用户输入。

source: The general concept is to constrain a given side of a widget to another side of any other widget.
zh_cn: 一般概念是将一个小部件的给定侧限制在任何其他小部件的另一侧。

source: The general contract of finalize is that it is invoked if and when the JavaTM virtual machine has determined that there is no longer any means by which this object can be accessed by any thread that has not yet died, except as a result of an action taken by the finalization of some other object or class which is ready to be finalized.
zh_cn: finalize 的通用协议是它的执行时机为，如果 Java TM 虚拟机确定这个对象不再被任何尚未死亡的线程访问，除非是由于某个其他准备 finalize 的对象或类的准备而产生的动作的结果。

source: The general contract of finalize is that it is invoked if and when the Java™ virtual machine has determined that there is no longer any means by which this object can be accessed by any thread that has not yet died, except as a result of an action taken by the finalization of some other object or class which is ready to be finalized.
zh_cn: finalize 的通用协议是它的执行时机为，如果 Java™ 虚拟机确定这个对象不再被任何尚未死亡的线程访问，除非是由于某个其他准备 finalize 的对象或类的准备而产生的动作的结果。

source: The geometry of a view is that of a rectangle.
zh_cn: view 的几何图形是一个矩形。

source: The golden rule of logging is that your logs may not unnecessarily push other logs out of the buffer, just as others may not push out yours.
zh_cn: 日志记录的黄金法则是，你的日志不一定要将其他日志排挤出缓冲区，正如其他日志不会这样对你的日志一样。

source: The gravity defaults to fill.
zh_cn: 重力默认为 fill。

source: The grid is composed of a set of infinitely thin lines that separate the viewing area into cells.
zh_cn: 网格由一组无限细线组成，将观察区域分成 cells (单元)。

source: The hash code of a member-value depends on its type:
zh_cn: 成员值的哈希码取决于其类型：

source: The hash code of a primitive value v is equal to WrapperType.valueOf(v).hashCode(), where WrapperType is the wrapper type corresponding to the primitive type of v (Byte, Character, Double, Float, Integer, Long, Short, or Boolean).
zh_cn: 基本类型的哈希码 v 等于 WrapperType.valueOf(v).hashCode() ， WrapperType 是基本类型 v 对应的包装类型 (Byte, Character, Double, Float, Integer, Long, Short, 或者 Boolean)。

source: The hash code of an annotation is the sum of the hash codes of its members (including those with default values), as defined below: The hash code of an annotation member is (127 times the hash code of the member-name as computed by hashCode()) XOR the hash code of the member-value, as defined below:
zh_cn: 注解的哈希码是它的成员的哈希码之和（包括那些默认值）；注解的成员的哈希码是 (127 乘以成员名的哈希码，由 hashCode() 计算 )，再 XOR 成员值的哈希码；:

source: The head is the left-most widget for horizontal chains, and the top-most widget for vertical chains.
zh_cn: 链头是水平链式最左边的部件，对于垂直链式是最顶部的部件。

source: The helper method resolveSizeAndState() is used to create the final width and height values.
zh_cn: 辅助方法 resolveSizeAndState() 用于创建最终的宽度和高度值。

source: The hint should be set on the TextInputLayout, rather than the EditText.
zh_cn: 应该在 TextInputLayout 上设置提示，而不是 EditText。

source: The horizontal bias attribute of the child will then affect the positioning of the packed elements
zh_cn: child 的水平偏心将会影响打包后的元素的位

source: The horizontal or vertical bias attribute of the child will then affect the positioning of the packed elements
zh_cn: child 的水平或垂直偏差属性将影响包装后的元素的位置。

source: The horizontal orientation.
zh_cn: 水平方向。

source: The id of the child radio button that should be checked by default within this radio group.
zh_cn: 子单选按钮的 id，默认情况下应在此单选组中选中。

source: The image is then centered in the view.
zh_cn: 然后图像在 view 中居中。

source: The image matrix can be set using setImageMatrix(Matrix).
zh_cn: 可以使用 setImageMatrix(Matrix) 设置图像矩阵。

source: The image on the surface of the button is defined either by the android:src attribute in the <ImageButton> XML element or by the ImageView.setImageResource(int) method.
zh_cn: 按钮表面上的图像由 <ImageButton> XML 元素中的 android:src 属性或 ImageView.setImageResource(int) 方法定义。

source: The implementation can inspect the DecodeException and optionally finish the rest of the decode creation process to create a partial Drawable or Bitmap.
zh_cn: 实现可以检查 DecodeException 并可选择完成解码创建过程的其余部分以创建部分 Drawable 或 Bitmap。

source: The implementation is not intended to be appropriate for data structures that may contain large numbers of items.
zh_cn: 该实现不适合于可能包含大量项的数据结构。

source: The implementation of onHeaderDecoded can then change the decode settings as desired.
zh_cn: onHeaderDecoded 的实现可以根据需要更改解码设置。

source: The implementation should report how any pixels of the scroll reported by dx, dy were consumed in the consumed array.
zh_cn: 该实现应该在 consumed 数组报告滚动消耗了多少像素，滚动由 dx，dy 报告。

source: The implicit state of a matcher includes the input character sequence as well as the append position, which is initially zero and is updated by the appendReplacement method.
zh_cn: 匹配器的隐式状态包括输入字符序列和 append position，最初是零，然后由 appendReplacement 方法更新。

source: The imports people want to look at first tend to be at the top (android).
zh_cn: 用户希望先看到的导入往往位于顶部(android)。

source: The imports people want to look at least tend to be at the bottom (java).
zh_cn: 用户最不希望看到的导入往往位于底部(java)。

source: The increased level of file access security offered by a content URI makes FileProvider a key part of Android's security infrastructure.
zh_cn: 由 content URI 提供的文件访问安全级别的提高使得 FileProvider 成为 Android 安全基础设施的关键部分。

source: The index of an attached child view as used in a call to getChildAt(int).
zh_cn: 已经附加的子 view 的索引，可用于调用 getChildAt(int) 时使用的参数。

source: The index of the first character captured by the group, or -1 if the match was successful but the group itself did not match anything
zh_cn: 组捕获的第一个字符的索引；如果匹配成功但组本身没有匹配项，则返回 -1 。

source: The index of the first character matched
zh_cn: 返回匹配的初始索引。

source: The index of the horizontal keyline specified to the parent CoordinatorLayout that this child should align relative to.
zh_cn: 指向此子项应相对的父 CoordinatorLayout 的水平 keyline 的索引。

source: The index of the span group including the item at the given adapter position
zh_cn: 包含所给 adapter position 对应的 item 的 span group 的 index。

source: The individual elements are typically controlled using this container object, rather than setting values on the child elements themselves.
zh_cn: 通常使用此容器对象控制各个元素，而不是在子元素本身上设置值。

source: The inflated View is added to the ViewStub's parent with the ViewStub's layout parameters.
zh_cn: 使用 ViewStub 的布局参数将加载的 view 添加到 ViewStub 的父级。

source: The inflated View is finally assigned a width of 120dip and a height of 40dip.
zh_cn: 加载的 view 最终被赋予 120dip 的宽度和 40dip 的高度。

source: The initial horizontal scroll offset, in pixels.
zh_cn: 初始水平滚动偏移，以像素为单位。

source: The initial vertical scroll offset, in pixels.
zh_cn: 初始垂直滚动偏移，以像素为单位。

source: The input type to set on the query text field.
zh_cn: 要在查询文本域上设置的输入类型。

source: The interaction patterns expressed by SlidingPaneLayout imply a physicality and direct information hierarchy between panes that does not necessarily exist in a scenario where a navigation drawer should be used instead.
zh_cn: SlidingPaneLayout 表示的交互模式意味着窗格之间的物理性和直接信息层次结构，而不一定存在于应该使用导航抽屉的场景中。

source: The item at position retains the same identity.
zh_cn: position 处的项保持相同的标识。

source: The item previously at position is now at position position + 1.
zh_cn: 以前位于 position 的项目现在位于 position + 1 位置。

source: The items come from the ExpandableListAdapter associated with this view.
zh_cn: 这些项目来自与此 view 关联的 ExpandableListAdapter。

source: The items in the Spinner come from the Adapter associated with this view.
zh_cn: Spinner 中的项目来自与此 view 关联的 Adapter。

source: The items in the given range retain the same identity.
zh_cn: 给定范围内的项目保持相同的标识。

source: The items in the grid come from the ListAdapter associated with this view.
zh_cn: 网格中的项目来自与此 view 关联的 ListAdapter。

source: The items previously located at positionStart and beyond can now be found starting at position positionStart + itemCount.
zh_cn: 以前位于 positionStart 及以后的项目现在可以从 positionStart + itemCount 开始的位置找到。

source: The items previously located at and after position may now be found at oldPosition - 1.
zh_cn: 以前位于 position 和之后的项目现在可以在 oldPosition - 1 找到。

source: The items previously located at and after positionStart + itemCount may now be found at oldPosition - itemCount.
zh_cn: 以前位于 positionStart + itemCount 处和之后的项目现在可以在 oldPosition - itemCount 处找到。

source: The keys corresponding to indices in ascending order are guaranteed to be in ascending order, e.g., keyAt(0) will return the smallest key and keyAt(size()-1) will return the largest key.
zh_cn: 与按升序排列的索引对应的键保证按升序排列，例如，keyAt(0) 将返回最小键，keyAt(size()-1) 将返回最大键。

source: The larger value of getContentInsetEnd() and this value will be used during layout.
zh_cn: getContentInsetEnd() 的值较大，在布局期间将使用此值。

source: The larger value of getContentInsetStart() and this value will be used during layout.
zh_cn: getContentInsetStart() 的值较大，布局过程中将使用此值。

source: The larger your view hierarchy, the more time the app takes to inflate it.
zh_cn: 视图层次结构越大，应用程序对其进行加载的时间就越长。

source: The last element of the array represents the bottom of the stack, which is the least recent method invocation in the sequence.
zh_cn: 数组的最后一个元素表示堆栈的底部，这是序列中最远的方法调用。

source: The last year (inclusive), for example "2010".
zh_cn: 最后一年(含)，例如“2010”。

source: The latter returns the top, or Y, coordinate of the rectangle representing the view.
zh_cn: 后者返回呈现 view 的矩形的 top 坐标或 Y 坐标。

source: The layouts android.R.layout.simple_expandable_list_item_1 and android.R.layout.simple_expandable_list_item_2 (which should be used with SimpleCursorTreeAdapter) contain the preferred position information for indicators.
zh_cn: android.R.layout.simple_expandable_list_item_1 和 android.R.layout.simple_expandable_list_item_2(应与 SimpleCursorTreeAdapter 一起使用)的布局包含指标的首选位置信息。

source: The left bound for a child's indicator.
zh_cn: 子项指示器的左边界。

source: The left bound for an item's indicator.
zh_cn: 项目指示器的左边界。

source: The left margin to use when the target is gone.
zh_cn: 当目标 gone 时使用的左边 margin。

source: The left side of a view in left to right languages.
zh_cn: 在从左到右的语言中，是 view 的左边。

source: The left side of a view.
zh_cn: view 的左边。

source: The list allows multiple choices
zh_cn: 该列表允许多种选择

source: The list allows multiple choices in a modal selection mode
zh_cn: 该列表允许在模态选择模式中进行多种选择

source: The list allows up to one choice
zh_cn: 该列表最多允许一个选项

source: The list of suggestions is displayed in a drop down menu from which the user can choose an item to replace the content of the edit box with.
zh_cn: 建议列表显示在下拉菜单中，用户可以从中选择要替换编辑框内容的项目。

source: The list of suggestions is obtained from a data adapter and appears only after a given number of characters defined by the threshold.
zh_cn: 建议列表从数据适配器获取，仅在 the threshold 定义的给定数量的字符后出现。

source: The list will automatically scroll to the bottom when a data set change notification is received and only if the last item is already visible on screen.
zh_cn: 当收到数据集更改通知时，列表将自动滚动到底部，并且仅当最后一个项目已在屏幕上可见时才会自动滚动到底部。

source: The list will automatically scroll to the bottom, no matter what items are currently visible.
zh_cn: 无论当前可见的项目如何，列表都将自动滚动到底部。

source: The list year's selected circle color in the list.
zh_cn: 列表中列表年份的选定圆圈颜色。

source: The list year's text appearance in the list.
zh_cn: 列表中列表年份的文本外观。

source: The logcat output sometimes includes a total time, as discussed in Time to initial display.
zh_cn: logcat 输出有时包括 total 时间，如 Time to initial display 中所述。

source: The logging call should not be re-factored out into a method call if it is going to cause the string building to take place outside of the if (LOCAL_LOG) block.
zh_cn: 如果日志记录调用会导致字符串编译在 if (LOCAL_LOG) 块之外发生，则不应将其重构为方法调用。

source: The logging facilities provides five different levels of logging:
zh_cn: 日志记录工具提供以下 5 种不同级别的日志记录：

source: The logging tag used by this class with android.util.Log.
zh_cn: 此类与 android.util.log 一起使用的日志标记。

source: The logical operations that can be performed when combining two paths.
zh_cn: 组合两个路径时​​可以执行的逻辑操作。

source: The logo cannot be clicked.
zh_cn: 无法点击 logo。

source: The main chip and close icon are considered to be separate logical sub-views, and contain their own navigation behavior and state.
zh_cn: 主 chip 和关闭图标被认为是独立的逻辑子 view，并包含自己的导航行为和状态。

source: The main purpose of this method is to indicate that you believe a method can be called from any thread; static tools can then check that nothing you call from within this method or class have more strict threading requirements.
zh_cn: 此方法的主要目的是表明你相信可以从任何线程调用方法；静态工具可以检查在该方法或类中调用的任何线程都没有更严格的线程需求。

source: The match boundaries, groups and group boundaries can be seen but not modified through a MatchResult.
zh_cn: 通过 MatchResult 可以查看匹配边界、组和组边界，但是不能修改。

source: The maximal date shown by this calendar view in mm/dd/yyyy format.
zh_cn: 此日历 view 以 mm/dd/yyyy 格式显示的最大日期。

source: The maximum height of this view.
zh_cn: 该 view 的最大高度。

source: The maximum number of columns to create when automatically positioning children.
zh_cn: 自动定位子项时要创建的最大列数。

source: The maximum number of rows to create when automatically positioning children.
zh_cn: 自动定位子项时要创建的最大行数。

source: The measure pass uses two classes to communicate dimensions.
zh_cn: 测量过程用两个类来传递尺寸。

source: The measuring pass is implemented in measure(int, int) and is a top-down traversal of the view tree.
zh_cn: 测量过程在 measure(int, int) 实现，它是一个至顶向下的递归过程。

source: The menu contents can be populated by a menu resource file.
zh_cn: 菜单内容可以由菜单资源文件填充。

source: The method returns a boolean to indicate whether the scroller is finished.
zh_cn: 该方法返回一个布尔值以指示滚动是否已完成。

source: The middle area shows the pixels that differ between the original and the encoded image.
zh_cn: 中间区域显示原始图像和编码图像之间不同的像素。

source: The mimeType of the image.
zh_cn: 图像的 mimeType。

source: The minimal date shown by this calendar view in mm/dd/yyyy format.
zh_cn: 此日历 view 以 mm/dd/yyyy 格式显示的最小日期。

source: The minimum height of this view.
zh_cn: 该 view 的最小高度。

source: The most common input event in the Android system is touch, which triggers onTouchEvent(android.view.MotionEvent).
zh_cn: Android 系统中最常见的输入事件是 touch，它触发 onTouchEvent(android.view.MotionEvent)。

source: The most generic view you can extend is, unsurprisingly, View, so you will usually start by extending this to create your new super component.
zh_cn: 不出意料的，你可以继承的最通用的 view 是 View 所以通常情况你会从继承这个类开始创建你的组件。

source: The most important part of a custom view is its appearance.
zh_cn: 自定义 view 最重要的部分是它的外观。

source: The most important step in drawing a custom view is to override the onDraw() method.
zh_cn: 绘制自定义 view 最重要的步骤是覆盖 onDraw() 方法。

source: The motion event being dispatched down the hierarchy.
zh_cn: 在层次结构中分发的动作事件。

source: The motion event to be dispatched.
zh_cn: 要分发的动作事件。

source: The motion event.
zh_cn: 动作事件。

source: The name of the parent class is an homage to the work of Thomas Porter and Tom Duff, presented in their seminal 1984 paper titled "Compositing Digital Images".
zh_cn: 父类的名字是对 Thomas Porter 和 Tom Duff 的工作的致敬，他们在 1984 年发表的题为 "合成数字图像" 的开创性论文中作了介绍。

source: The name of the styleable entity is, by convention, the same name as the name of the class that defines the custom view.
zh_cn: 按照惯例，styleable 实体的名称与定义自定义 view 的类的名称相同。

source: The navigation button (formerly "Home") takes over the space previously occupied by the application icon.
zh_cn: 导航按钮(以前称为“Home”)接管应用程序图标先前占用的空间。

source: The navigation button appears at the start of the toolbar if present.
zh_cn: 导航按钮出现在工具栏的开头(如果存在)。

source: The navigation button is vertically aligned within the Toolbar's minimum height, if set.
zh_cn: 导航按钮在工具栏的 minimum height 内垂直对齐(如果已设置)。

source: The new ViewHolder will be used to display items of the adapter using #onBindViewHolder(ViewHolder, int, List).
zh_cn: 新的 ViewHolder 将用于显示适配器的项，使用 #onBindViewHolder(ViewHolder, int, List) 方法。

source: The next section deals with retrieving and applying the values at runtime.
zh_cn: 下一节将介绍如何在运行时获取和应用值。

source: The next section discusses Paint in more detail.
zh_cn: 下一节将更详细地讨论 Paint。

source: The number of capturing groups in this matcher's pattern
zh_cn: 此匹配器模式中的捕获组数

source: The number of spans occupied by the item at the provided position
zh_cn: 所提供的位置处的 item 占据的 span 数。

source: The number of stars (or rating items) to show.
zh_cn: 要显示的星数(或评级项)。

source: The number of stars set (via setNumStars(int) or in an XML layout) will be shown when the layout width is set to wrap content (if another layout width is set, the results may be unpredictable).
zh_cn: 当布局宽度设置为 wrap content 时，将显示设置的星数（通过 setNumStars(int) 或在 XML 布局中设置）（如果设置了别的布局宽度，结果可能无法预测）。

source: The number of weeks to be shown.
zh_cn: 要显示的周数。

source: The offset after the last character captured by the group, or -1 if the match was successful but the group itself did not match anything
zh_cn: 组捕获的最后字符之后的偏移量；如果匹配成功但组本身没有匹配项，则返回 -1。

source: The offset is defined by the constrained view's margin.
zh_cn: 偏移由被约束的 view 的 margin 定义。

source: The offset of the baseline within this view.
zh_cn: 此 view 中基线的偏移量。

source: The only delimiter that is recognized in a CDATA section is the "]]>" string that ends the CDATA section.
zh_cn: 在 CDATA 部分中识别的唯一分隔符是 CDATA 部分结束处的 "]]>" 字符串。

source: The only difference is that your custom attributes belong to a different namespace.
zh_cn: 唯一的区别是你的自定义属性属于不同的命名空间。

source: The only limit is your imagination and what you need the component to do.
zh_cn: 唯一的限制就是你的想象力和你需要组件干什么。

source: The only situations that should trigger logging at the INFORMATIVE level or higher is when a module or application detects an error at its own level or coming from a lower level.
zh_cn: 应该触发 INFORMATIVE 级别或更高级别日志记录的唯一情况是，模块或应用在其自身级别或更低级别检测到错误。

source: The only time you should return false from onDown() is if you truly want to ignore an entire gesture.
zh_cn: 你应该从 onDown() 返回 false 的唯一时间是如果你真的想要忽略整个手势。

source: The order of drawing operations used to generate each diagram is shown in the following code snippet:
zh_cn: 下面的代码片段显示了用于生成每个图的绘图操作顺序：

source: The order of the <item> elements is important because they are evaluated in order.
zh_cn: <item> 元素的顺序很重要，因为它们按顺序进行计算。

source: The ordering of import statements is:
zh_cn: import 语句的顺序为：

source: The orientation property is not used during layout.
zh_cn: 布局期间不使用 orientation 属性。

source: The other attributes and parameters in the definition are the ones passed into the custom component constructor, and then passed through to the EditText constructor, so they are the same parameters that you would use for an EditText view.
zh_cn: 定义的其他属性和参数会传递到自定义组件的构造方法中，然后再传给 EditText 的构造方法，所以和 EditText 使用的参数相同。
